In [10]:
import pandas as pd

In [14]:
credit_records = pd.read_csv('https://docs.google.com/spreadsheets/d/e/2PACX-1vQYe0Lsydx6HyVe4FBHjBsLxvAsjii-qobZ-oGGZryFJWRFjemjs43BwZQONRAhLCawSUBkBDI__-Xw/pub?gid=1503578122&single=true&output=csv')

In [15]:
credit_records.head()

            suspect         location   date         item  price
0    Kirstine Smith   Groceries R Us  43106     broccoli   1.25
1      Gertrude Cox  Petroleum Plaza  43106  fizzy drink   1.90
2  Fred Frequentist   Groceries R Us  43106     broccoli   1.25
3      Gertrude Cox   Groceries R Us  43112     broccoli   1.25
4    Kirstine Smith    Clothing Club  43109        shirt  14.25

## Selecting Columns

In [22]:
credit_records['price'].sum()

908.9000000000001

In [27]:
credit_records.price.sum()

908.9000000000001

## Selecting Row with Logic

In [28]:
credit_records.head()

            suspect         location   date         item  price
0    Kirstine Smith   Groceries R Us  43106     broccoli   1.25
1      Gertrude Cox  Petroleum Plaza  43106  fizzy drink   1.90
2  Fred Frequentist   Groceries R Us  43106     broccoli   1.25
3      Gertrude Cox   Groceries R Us  43112     broccoli   1.25
4    Kirstine Smith    Clothing Club  43109        shirt  14.25

In [31]:
credit_records[credit_records['price']> 20].head()

                 suspect         location   date   item  price
28      Fred Frequentist    Clothing Club  43103  dress  20.15
29        Kirstine Smith    Clothing Club  43105  dress  20.15
33  Ronald Aylmer Fisher  Petroleum Plaza  43107    gas  24.95
37      Fred Frequentist    Clothing Club  43108  dress  20.15
40          Gertrude Cox    Clothing Club  43101  dress  20.15

In [36]:
mpr = pd.read_csv(".\data\mpr.csv")

In [37]:
mpr.head()

  Dog Name             Owner Name         Dog Breed         Status  Age
0    Bayes               DataCamp  Golden Retriever  Still Missing    1
1  Sigmoid                    NaN         Dachshund  Still Missing    2
2   Sparky             Dr. Apache     Border Collie          Found    3
3  Theorem  Joseph-Louis Lagrange    French Bulldog          Found    4
4      Ned           Tim Oliphant          Shih Tzu  Still Missing    2

In [38]:
greater_than_2 = mpr[mpr.Age > 2]
greater_than_2

  Dog Name             Owner Name       Dog Breed Status  Age
2   Sparky             Dr. Apache   Border Collie  Found    3
3  Theorem  Joseph-Louis Lagrange  French Bulldog  Found    4
5    Benny   Hillary Green-Lerman          Poodle  Found    3

In [41]:
still_missing = mpr[mpr.Status == 'Still Missing']
still_missing

  Dog Name    Owner Name         Dog Breed         Status  Age
0    Bayes      DataCamp  Golden Retriever  Still Missing    1
1  Sigmoid           NaN         Dachshund  Still Missing    2
4      Ned  Tim Oliphant          Shih Tzu  Still Missing    2

In [42]:
not_poodle = mpr[mpr['Dog Breed'] != "Poodle"]
not_poodle

  Dog Name             Owner Name         Dog Breed         Status  Age
0    Bayes               DataCamp  Golden Retriever  Still Missing    1
1  Sigmoid                    NaN         Dachshund  Still Missing    2
2   Sparky             Dr. Apache     Border Collie          Found    3
3  Theorem  Joseph-Louis Lagrange    French Bulldog          Found    4
4      Ned           Tim Oliphant          Shih Tzu  Still Missing    2

In [43]:
credit_records.head()

            suspect         location   date         item  price
0    Kirstine Smith   Groceries R Us  43106     broccoli   1.25
1      Gertrude Cox  Petroleum Plaza  43106  fizzy drink   1.90
2  Fred Frequentist   Groceries R Us  43106     broccoli   1.25
3      Gertrude Cox   Groceries R Us  43112     broccoli   1.25
4    Kirstine Smith    Clothing Club  43109        shirt  14.25

In [45]:
purchase = credit_records[credit_records.location == 'Pet Paradise']
purchase

Empty DataFrame
Columns: [suspect, location, date, item, price]
Index: []